[Killed] ConditionalExpression
src/transcriptManager.ts:68:49
 }
 
 export function addGrade(studentID: StudentID, course: Course, grade: number): void {
-  const tIndex = allTranscripts.findIndex(t => (t.student.studentID == studentID));
+  const tIndex = allTranscripts.findIndex(t => (true));
   if (tIndex == -1) {
     throw new Error(`no student with ID = ${studentID}`);
killedBy: TranscriptManager Adding grades Should throw an error if the student ID does not exist
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "no student with ID = 10"

Received function did not throw

[Killed] UnaryOperator
src/transcriptManager.ts:69:17
 
 export function addGrade(studentID: StudentID, course: Course, grade: number): void {
   const tIndex = allTranscripts.findIndex(t => (t.student.studentID == studentID));
-  if (tIndex == -1) {
+  if (tIndex == +1) {
     throw new Error(`no student with ID = ${studentID}`);
   }
killedBy: TranscriptManager Adding grades Should throw an error if the student ID is invalid
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "no student with ID = 1"
Received message:   "student 1 already has a grade in course test course"

      209 |       } else {
      210 |         stryCov_9fa48("2039");
    > 211 |         throw new Error(stryMutAct_9fa48("2040") ? `` : (stryCov_9fa48("2040"), `student ${studentID} already has a grade in course ${course}`));

[Killed] ConditionalExpression
src/transcriptManager.ts:69:7
 
 export function addGrade(studentID: StudentID, course: Course, grade: number): void {
   const tIndex = allTranscripts.findIndex(t => (t.student.studentID == studentID));
-  if (tIndex == -1) {
+  if (false) {
     throw new Error(`no student with ID = ${studentID}`);
   }
killedBy: TranscriptManager Adding grades Should throw an error if the student ID is invalid
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "no student with ID = 1"
Received message:   "student 1 already has a grade in course test course"

      209 |       } else {
      210 |         stryCov_9fa48("2039");
    > 211 |         throw new Error(stryMutAct_9fa48("2040") ? `` : (stryCov_9fa48("2040"), `student ${studentID} already has a grade in course ${course}`));

[Killed] BlockStatement
src/transcriptManager.ts:82:108
 
 // returns transcript like the original, but with the new grade added.
 // throws an error if the course is already on the transcript
-export function addGradeToTranscript(theTranscript: Transcript, course: Course, grade: number): Transcript {
-  const { grades } = theTranscript;
-  if (grades.findIndex(entry => entry.course === course) != -1) {
-    throw new Error();
-  }
-  return { student: theTranscript.student, grades: grades.concat({ course, grade }) };
-}
+export function addGradeToTranscript(theTranscript: Transcript, course: Course, grade: number): Transcript {}
 
 //
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: TypeError: Cannot read properties of undefined (reading 'student')

[Killed] OptionalChaining
src/transcriptManager.ts:93:20
 //
 export function getGrade(studentID: StudentID, course: Course): number {
   const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
-  const theGrade = theTranscript?.grades.find(g => g.course == course);
+  const theGrade = theTranscript.grades.find(g => g.course == course);
   if (theGrade === undefined) {
     throw new Error(`no grade for student ${studentID} in course ${course}`);
killedBy: TranscriptManager Get grade Should throw an error if student does not exist
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "no grade for student 10 in course math"
Received message:   "Cannot read properties of undefined (reading 'grades')"

      250 |     stryCov_9fa48("2053");
